hackables-cc/hackables_core/samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Arduino/Genuino Zero (Native USB Port)
# --------------------------------------
sensor_tree.name=Hackables SensorTree (Native USB Port)
sensor_tree.vid.0=0x2341
sensor_tree.pid.0=0x804d
sensor_tree.vid.1=0x2341
sensor_tree.pid.1=0x004d

sensor_tree.vid.2=0x2341
sensor_tree.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
sensor_tree.vid.2.build.vid=0x2341
sensor_tree.vid.2.build.pid=0x824d
sensor_tree.vid.2.build.usb_product="Genuino Zero"
sensor_tree.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

sensor_tree.vid.3=0x2341
sensor_tree.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
sensor_tree.vid.3.build.vid=0x2341
sensor_tree.vid.3.build.pid=0x824d
sensor_tree.vid.3.build.usb_product="Genuino Zero"
sensor_tree.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

sensor_tree.upload.tool=bossac
sensor_tree.upload.protocol=sam-ba
sensor_tree.upload.maximum_size=262144
sensor_tree.upload.use_1200bps_touch=true
sensor_tree.upload.wait_for_upload_port=true
sensor_tree.upload.native_usb=true
sensor_tree.build.mcu=cortex-m0plus
sensor_tree.build.f_cpu=48000000L
sensor_tree.build.usb_product="Arduino Zero"
sensor_tree.build.usb_manufacturer="Arduino LLC"
sensor_tree.build.board=SAMD_ZERO
sensor_tree.build.core=arduino
sensor_tree.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
sensor_tree.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sensor_tree.build.openocdscript=openocd_scripts/arduino_zero.cfg
sensor_tree.build.variant=sensor_tree
sensor_tree.build.variant_system_lib=
sensor_tree.build.vid=0x2341
sensor_tree.build.pid=0x804d
sensor_tree.bootloader.tool=openocd
sensor_tree.bootloader.file=zero/samd21_sam_ba.bin
